Notes/planning.tex
% Created 2017-07-28 Fri 11:51
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usepackage[margin=0.8in]{geometry}
\usepackage{amssymb,amsmath}
\usepackage{fancyhdr} %For headers and footers
\pagestyle{fancy} %For headers and footers
\usepackage{lastpage} %For getting page x of y
\usepackage{float} %Allows the figures to be positioned and formatted nicely
\floatstyle{boxed} %using this
\restylefloat{figure} %and this command
\usepackage{hyperref}
\hypersetup{urlcolor=blue}
\usepackage{minted}
\setminted{frame=single,framesep=10pt}
\chead{}
\rhead{\today}
\cfoot{}
\rfoot{\thepage\ of \pageref{LastPage}}
\author{Nathan Hughes (\href{mailto:nah31@aber.ac.uk}{nah31@aber.ac.uk})}
\date{\today}
\title{GenSoc Planning and schedule}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\maketitle
\clearpage
\tableofcontents
\clearpage


\section{Week 1: 3rd - 7th July}
\label{sec-1}

\subsection{{\bfseries\sffamily DONE} Read up on QTL Analysis}
\label{sec-1-1}
I'll need a thorough understanding of the analysis techniques that are used in identifying potential QTLs. 
A literature review of current work with mapping populations and grasses would also be helpful.  


\subsection{{\bfseries\sffamily DONE} Learn R}
\label{sec-1-2}
Having identified that the majority of QTL analysis is done using the R programming language, I will need to spend a considerable amount of time 
learning both current packages for analysis and the semantics of the R language itself. 

\section{Week 2: 10th - 14th July}
\label{sec-2}

\subsection{{\bfseries\sffamily DONE} Prepare image analysis software}
\label{sec-2-1}
I'll be needing to take the uCT software that I'd previously written and make several adjustments, as well as experimenting with ideal  parameters for this previously 
unused species of brachypodium. 

It'll mostly be resolution adjustments and ground truth verification of input/output.

\subsection{{\bfseries\sffamily DONE} Process Brachypodium scans}
\label{sec-2-2}
The entire population that we have scanned so far (141 F8 plants and 3 scans from each parent ABR6 and BD21) will need to be processed, data lifted and then prepared for analysis. 


\section{Week 3: 17th - 21th July}
\label{sec-3}
\subsection{{\bfseries\sffamily DONE} Perform initial data analysis}
\label{sec-3-1}
Using initial data gathered check for patterns in both phenotype data and genotype data. 
\subsubsection{{\bfseries\sffamily DONE} Genotypic Analysis}
\label{sec-3-1-1}
Compile together the gathered data to QTL workable formats and then run checks for potential QTLs. 
\subsubsection{{\bfseries\sffamily DONE} Phenotypic Analysis}
\label{sec-3-1-2}
Run statistical tests on data to enquire as to potential relationships and areas of interest for future work. 


\section{Week 4: 24th - 28th July}
\label{sec-4}
\subsection{{\bfseries\sffamily TODO} Scan additional plant material to support hypothesised QTLs (1/2)}
\label{sec-4-1}
There are 141 plants which have been crossed, we want to scan more heads from each plant. 
Ideally we want 3+ heads to give us 3x the data we currently have in order to give further support of our hypothesised QTLs.

We can do 12x scans per day, 6 days a week thus 72\textasciitilde{} scans this week and 72\textasciitilde{} the next, we should be completed by then and ready to rerun analysis.  

\begin{longtable}{|l|p{10cm}|}
\hline
Date & Notes\\
\hline
\endhead
\hline\multicolumn{2}{r}{Continued on next page} \\
\endfoot
\endlastfoot
\textit{<2017-07-25 Tue>} & Started scanning today, currently on 1-12\\
 & Parent scans (1 \& 2 ) also done\\
\hline
\textit{<2017-07-26 Wed>} & Karen loaded up 13-24\\
\hline
\textit{<2017-07-27 Thu>} & 25-36 loaded by me\\
\hline
\textit{<2017-07-28 Fri>} & 37-48 loaded by me, 31 had to be rescanned, so remember this when analysing\\
\hline
\end{longtable}



\section{Week 5: 31st July - 4th August}
\label{sec-5}
\subsection{{\bfseries\sffamily TODO} Scan additional plant material to support hypothesised QTLs (2/2)}
\label{sec-5-1}
Hopefully scanning will be completed this week and we can proceed to re-run analysis previous written

\section{Week 6: 7th - 11th August}
\label{sec-6}
\subsection{{\bfseries\sffamily TODO} Run image processing and analysis on newly gathered scan data}
\label{sec-6-1}


\section{Week 7: 14th - 18th August}
\label{sec-7}
\subsection{{\bfseries\sffamily TODO} Analyse for QTLs previously identified}
\label{sec-7-1}

\section{Week 8: 21st - 26th August}
\label{sec-8}
\subsection{{\bfseries\sffamily TODO} Compile findings and write report}
\label{sec-8-1}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}